app/views/links/_link.html.erb

        <h2> <%= link_to link.title, link_path(link) %></h2>
        <p class="link_details"><small>submitted <%= time_ago_in_words link.created_at %> ago,
           by <%= link.user.email %>,
           <%= pluralize link.comments.count, 'Comment' %></small></p><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 13]]