app/views/links/show.html.erb

	<br>
	<h3><%= pluralize @link.comments.count, 'Comment' %></h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 13]]

	<div id="comments">
		<%= render :partial => "comments/comment", :collection => @link.comments if @link.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."link_id" = ? LIMIT 1  [["link_id", 14]]