app/controllers/comments_controller.rb

  def create
  	@comment = @link.comments.build(comment_params)
  	@comment.user = current_user
  	respond_to do |format|
	  	if @comment.save
---
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test the comment system"], ["link_id", 1], ["user_id", 2], ["created_at", "2015-06-15 12:06:40.836530"], ["updated_at", "2015-06-15 12:06:40.836530"]]

  def destroy
  	#@link.comments.where(id: params[:id]).destroy
  	respond_to do |format|
	  	if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]

  def set_link
  	@link = Link.find_by(id: params[:link_id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 14]]