app/controllers/links_controller.rb

SELECT "links".* FROM "links"  ORDER BY "links"."created_at" DESC
---
  def index
    @links = Link.order(created_at: :desc)

SELECT "links".* FROM "links" WHERE "links"."user_id" = ?  ORDER BY "links"."created_at" DESC  [["user_id", 2]]
---
  def user_links
    @links = current_user.links.order(created_at: :desc)

INSERT INTO "links" ("title", "url", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @link = Link.new(link_params)
    @link.user = current_user
    respond_to do |format|
      if @link.save